import 'package:mirea_horizon/data/models/collaborators/collab_item.dart';

class DirectionService {
  final direction = [
    Direction(
        title: 'Цифровые комплексы, системы и сети',
        direction: '09.03.01 Информатика и вычислительная техника',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые владеют технологиями и навыками в области проектирования, разработки, сопровождения, эксплуатации и программирования цифровых устройств, входящих в состав комплексов, систем и сетей, предназначенных как для хранения, обработки и передачи данных, так и для решения задач автоматизации. Студенты обучаются работать с широким спектром логических интегральных схем, микроконтроллеров и микропроцессоров. Выпускники высоко востребованы в государственных и коммерческих организациях и структурах в связи с широким применением цифровой электроники во всех отраслях национальной экономики, включая потребительский сектор.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/0bb91c610cce306b9c5bc05dfbf555cd178453c3.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1190'),
    Direction(
        title: 'Промышленная информатика',
        direction: '09.03.01 Информатика и вычислительная техника',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые знают технологии построения цифровых двойников, систем управления технологическим оборудованием, специализированное программное обеспечение MES, CAE, CAD, CAM, SCADA.Выпускники умеют создавать самостоятельное программное обеспечение, интегрировать свои решения в существующие программные продукты и системы.Важность специалистов обусловлена тем, что современная промышленность осуществляет переход на цифровые платформы подготовки, организации и управления производством, технологическим процессом и оборудованием. Цифровая трансформация требует высококвалифицированных ИТ-специалистов, которые способны проектировать, разрабатывать и эксплуатировать программно-аппаратные комплексы, информационно-управляющие системы, применяемые на производственных предприятиях различных отраслей.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/2af83067e6b07d097ff4e0ed73e7d5c9542c8342.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1193'),
    Direction(
        title: 'Фуллстек разработка',
        direction: '09.03.02 Информационные системы и технологии',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые умеют производить разработку программного обеспечения с использованием различных языков программирования: С++, Python, Javascript, Go, C# и др., а также с применением разнообразных паттернов и фреймворков. Выпускники способны работать с ключевыми технологиями программной разработки, а потому они наиболее востребованы на IT-рынке.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/ef96c8acf13c8ac45424fe89b81fdbcc1305a9e9.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1196'),
    Direction(
        title: 'Технологии искусственного интеллекта и анализ данных',
        direction: '09.03.02 Информационные системы и технологии',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые знают методы обработки больших данных, технологии программирования, методы искусственного интеллекта, алгоритмы и способы сбора данных, методы OSINT.Они умеют использовать методы искусственного интеллекта для обработки и анализа данных цифрового следа, применять специализированное программное обеспечение реализации Data Science.Специалисты незаменимы в службах безопасности, дата-центрах, в отделах рекламы и маркетинга, для развития городской инфраструктуры.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/64af40f849f27fd4a9b463e0b41962a22f902ce0.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1200'),
    Direction(
        title: 'Технологии разработки программного обеспечения полного цикла',
        direction: '09.03.02 Информационные системы и технологии',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые обладают фундаментальными знаниями технологий, языков и методов программирования. В процессе обучения студенты получают навыки разработки информационных систем с учётом актуальных требований по обеспечению информационной безопасности, надёжности функционирования, устойчивости к внешним воздействиям, включая кибератаки. В процессе обучения акцент делается на подготовку в рамках методологии DevOps, что существенно позволяет расширить знания и навыки выпускников.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/64af40f849f27fd4a9b463e0b41962a22f902ce0.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1201'),
    Direction(
        title: 'Безопасность программных решений',
        direction: '09.03.02 Информационные системы и технологии',
        description:
            'В рамках профиля ведётся подготовка разработчиков программных решений с глубокими знаниями в области прикладной математики и машинного обучения, которые специализируются в проектировании и разработке сложных информационных систем, что соответствует современным требованиям отечественного рынка.Студенты изучают прикладные методы математической статистики, методы и технологии программирования, с учётом требований безопасности при их разработке, устойчивости к внешнему воздействию, включая кибератаки.Также студенты изучат Хендбуки Яндекс — онлайн-учебники по языкам программирования Python, C++, и GO, а также современные способы и методы разработки программных решений: проектирование, отладку и их эксплуатацию.Сфера профессиональной деятельности выпускников — разработка программных продуктов, хранение, анализ и защита данных, а также технологии проверки программных решений в области информационной безопасности.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/64af40f849f27fd4a9b463e0b41962a22f902ce0.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1863'),
    Direction(
        title:
            'Разработка и дизайн компьютерных игр и мультимедийных приложений',
        direction: '09.03.04 Программная инженерия',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые владеют технологиями и навыками проектирования и разработки мобильных приложений и интернет-ресурсов с углублённой специализацией в создании компьютерных игр, мультимедийных приложений и их контента. Особое внимание уделяется дизайну цифровых продуктов и гейм дизайну, компьютерной графике и анимации, технологиям и системам захвата движений и мимики актёров. Выпускники высоко востребованы в государственных и коммерческих организациях и структурах в связи с активным развитием игровой, креативной и медиаиндустрии, а также ростом востребованности высококачественного мультимедийного интерактивного контента.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/3967fedc49985b43e8ad43b9064f04f6ab751b68.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1206'),
    Direction(
        title:
            'Разработка программных продуктов и проектирование информационных систем',
        direction: '09.03.04 Программная инженерия',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые владеют технологиями и навыками проектирования и разработки мобильных, браузерных и десктопных клиент-серверных систем. Сферами компетенции студентов профиля являются одновременно frontend, backend, mobile и desktop разработка, а также администрирование сервисного программного обеспечения, информационный менеджмент, проектирование и создание баз и хранилищ данных. Выпускники высоко востребованы в государственных и коммерческих организациях и структурах в связи с необходимостью разработки и сопровождения их интернет-сайтов, мобильных приложений, информационных систем и сервисов различного назначения.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/64af40f849f27fd4a9b463e0b41962a22f902ce0.pngs',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1207'),
    Direction(
        title: 'Прикладные ИТ-решения для бизнеса',
        direction: '38.03.05 Бизнес-информатика',
        description:
            'В рамках профиля ведётся подготовка специалистов, которые знают принципы и методы разработки программного обеспечения для бизнеса, основы языков программирования, используемых в разработке прикладных решений на платформе 1С:Предприятие, бизнес-процессы и возможности их автоматизации на платформе 1С:Предприятие. Также они владеют навыками системного администрирования и управления проектами, основными принципами разработки и внедрения прикладных IT-решений для бизнеса.Такие специалисты умеют проводить анализ требований бизнеса и проектировать соответствующие информационные системы, разрабатывать и внедрять программные решения для автоматизации бизнес-процессов, управлять клиентскими данными, анализировать и обрабатывать данные, оптимизировать работу предприятий, создавать отчёты и аналитические дашборды для бизнес-аналитики.Востребованность таких специалистов обусловлена несколькими ключевыми аспектами:Знание продуктов 1С. Специалист по прикладным ИТ-решениям является экспертом по использованию программных продуктов компании 1С. Это включает в себя умение настраивать, поддерживать и оптимизировать 1С-решения для конкретного бизнеса. Без такого специалиста компания может столкнуться с проблемами в работе с программными продуктами и не сможет полностью использовать их потенциал.Интеграция с бизнес-процессами. Специалист по прикладным ИТ-решениям владеет знаниями в области бизнес-процессов компании, что позволяет правильно настроить и приспособить программные продукты 1С под конкретные потребности бизнеса.',
        imageUrl:
            'https://priem.mirea.ru/lk/storage/2025/03/05/7ce08dddc975b426228cd3f89e2a80953435deb3.png',
        url: 'https://priem.mirea.ru/guide-direction?direction_id=1254'),
  ];

  Future<List<Direction>> fetchAllDirections() async {
    List<Direction> directions = [];
    for (var direct in direction) {
      directions.add(direct);
    }
    return directions;
  }
}
